InformationRegisters/РазмерыДоходовНеПодлежащихНалогообложениюЧастично.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РазмерыДоходовНеПодлежащихНалогообложениюЧастично</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПредела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПределовВычетовИКорректировокДоходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДоходаНеПодлежащегоНалогообложениюЧастично</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНеПодлежащиеНалогообложениюЧастично</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПределовВычетовИКорректировокДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПределовВычетовИКорректировокДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МЗП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/РазмерыДоходовНеПодлежащихНалогообложениюЧастично/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьРазмерыДоходовНеПодлежащихНалогообложениюЧастично();
	
КонецПроцедуры

Процедура ЗаполнитьРазмерыДоходовНеПодлежащихНалогообложениюЧастично()
	
	НаборЗаписей = РегистрыСведений.РазмерыДоходовНеПодлежащихНалогообложениюЧастично.СоздатьНаборЗаписей();

	ВыигрышиПоЛотерее = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 11 п. 1 ст. 341 (выигрыши по лотере)");
	
	Если НЕ ВыигрышиПоЛотерее = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20190101', ВыигрышиПоЛотерее, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 6);
	
	КонецЕсли;
	
	ОбщественныеРаботы = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 12 п. 1 ст. 341 (выплаты в связи с выполнением общественных работ и профессиональным обучением)");
	
	Если НЕ ОбщественныеРаботы = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20190101', ОбщественныеРаботы, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 12);
		
	КонецЕсли;
	
	МедУслугиРождениеПогребение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 18 п. 1 ст. 341 (выплаты для оплаты медицинских услуг, при рождении ребенка, на погребение)");
	
	Если НЕ МедУслугиРождениеПогребение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20190101', МедУслугиРождениеПогребение, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 94);
		
	КонецЕсли;
	
	ДивидендыФизическихЛиц = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 8 п. 1 ст. 341 (дивиденды, полученные от юридического лица – резидента)");
	
	Если НЕ ДивидендыФизическихЛиц = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20230101', ДивидендыФизическихЛиц, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 30000);
		
	КонецЕсли;
	
	ВыигрышиПоЛотерее2026 = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 12 п. 1 ст. 436 (выигрыши по лотерее)");
	
	Если НЕ ВыигрышиПоЛотерее2026 = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20260101', ВыигрышиПоЛотерее2026, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 6);
	
	КонецЕсли;
	
	ПрофессиональноеОбучение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 13 п. 1 ст. 432 (выплаты в связи с профессиональным обучением)");
	
	Если НЕ ПрофессиональноеОбучение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20260101', ПрофессиональноеОбучение, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 12);
		
	КонецЕсли;
	
	ВыплатыНаПогребение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.НайтиПоНаименованию("Пп. 3 п. 1 ст. 436 (выплаты на погребение физического лица)");
	
	Если НЕ ВыплатыНаПогребение = Справочники.ДоходыНеПодлежащиеНалогообложениюЧастично.ПустаяСсылка() Тогда
		
		ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, '20260101', ВыплатыНаПогребение, Перечисления.ВидыПределовВычетовИКорректировокДоходов.МРП, 94);
		
	КонецЕсли;

	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьРазмерДоходаНеПодлежащегоНалогообложениюЧастично(НаборЗаписей, Период, ВидДохода, ВидПредела, Размер) Экспорт
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.ВидДоходаНеПодлежащегоНалогообложениюЧастично = ВидДохода;
	НоваяЗапись.ВидПредела = ВидПредела;
	НоваяЗапись.Размер = Размер;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
